INSERT INTO Authors (author_name)
VALUES
    ('Александр Пушкин'),
    ('Лев Толстой'),
    ('Федор Достоевский'),
    ('Джордж Оруэлл'),
    ('Джейн Остин');


INSERT INTO Products (product_type, title, purchase_price, quantity)
VALUES
    ('Книга', 'Евгений Онегин', 12.99, 50),
    ('Книга', 'Война и мир', 19.99, 50),
    ('Книга', 'Преступление и наказание', 14.99, 50),
    ('Книга', '1984', 9.99, 50),
    ('Книга', 'Гордость и предубеждение', 11.99, 50),
    ('Журнал', 'Наука и жизнь', 4.99, 50),
    ('Журнал', 'National Geographic', 5.99, 50),
    ('Книга', 'Анна Каренина', 13.99, 50),
    ('Книга', 'Идиот', 12.99, 50),
    ('Книга', 'Мастер и Маргарита', 15.99, 50),
    ('Журнал', 'Time', 6.99, 50),
    ('Книга', 'Скотный двор', 8.99, 50),
    ('Книга', 'Маленькие женщины', 10.99, 50),
    ('Журнал', 'Forbes', 7.99, 50),
    ('Книга', 'Война с саламандрами', 11.99, 50),
    ('Книга', 'Отец Горио', 9.99, 50),
    ('Журнал', 'The New Yorker', 6.99, 50),
    ('Книга', 'Преступление и наказание', 14.99, 50),
    ('Книга', 'Анна Каренина', 13.99, 50),
    ('Журнал', 'Smithsonian', 5.99, 50);


INSERT INTO Users (user_name, discount)
VALUES
    ('Иван Петров', 0.05),
    ('Мария Иванова', 0.02),
    ('Алексей Смирнов', 0.04),
    ('Елена Козлова', 0.03),
    ('Павел Новиков', 0.00);


INSERT INTO AuthorProduct (author_id, product_id)
VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5),
    (1, 8),
    (2, 9),
    (3, 10),
    (4, 15), 
    (5, 18),
    (1, 6), 
    (2, 7), 
    (3, 11),
    (4, 12),
    (5, 13),
    (1, 14),
    (2, 16), 
    (3, 17), 
    (4, 19),
    (5, 20);